Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وفاكهة كثيرة
en: And fruit in plenty,

source: لا مقطوعة ولا ممنوعة
en: Whose supply is not cut off (by change of season), nor are they out of reach,

source: وفرش مرفوعة
en: And on couches or thrones, raised high.

source: إنا أنشأناهن إنشاء
en: Verily, We have created them (maidens) of special creation.

source: فجعلناهن أبكارا
en: And made them virgins.

source: عربا أترابا
en: Loving (their husbands only), (and) of equal age.

source: لأصحاب اليمين
en: For those on the Right Hand.

source: وثلة من الآخرين
en: And a multitude of those (on the Right Hand) will be from the later generations.

source: وأصحاب الشمال ما أصحاب الشمال
en: And those on the Left Hand - how (unfortunate) will be those on the Left Hand?

source: في سموم وحميم
en: In fierce hot wind and boiling water,

source: وظل من يحموم
en: And shadow of black smoke,

source: لا بارد ولا كريم
en: (That shadow) neither cool, nor (even) pleasant,

source: إنهم كانوا قبل ذلك مترفين
en: Verily, before that, they indulged in luxury,

source: وكانوا يصرون على الحنث العظيم
en: And were persisting in great sin (joining partners in worship along with Allah, committing murder and other crimes)

source: وكانوا يقولون أئذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: And they used to say: "When we die and become dust and bones, shall we then indeed be resurrected?

source: قل إن الأولين والآخرين
en: Say (O Muhammad صلى الله عليه وسلم): "(Yes) verily, those of old, and those of later times.

source: لمجموعون إلى ميقات يوم معلوم
en: "All will surely be gathered together for appointed Meeting of a known Day.

source: ثم إنكم أيها الضالون المكذبون
en: "Then moreover, verily you the erring-ones, the deniers (of Resurrection)!

source: لآكلون من شجر من زقوم
en: "You verily will eat of the trees of Zaqqum.

source: فمالئون منها البطون
en: "Then you will fill your bellies therewith,

source: فشاربون عليه من الحميم
en: "And drink boiling water on top of it.

source: فشاربون شرب الهيم
en: "And you will drink (that) like thirsty camels!"

source: هذا نزلهم يوم الدين
en: That will be their entertainment on the Day of Recompense!

source: نحن خلقناكم فلولا تصدقون
en: We created you: then why do you believe not?

source: أفرأيتم ما تمنون
en: Then tell Me (about) the (human) semen that you emit.

source: أأنتم تخلقونه أم نحن الخالقون
en: Is it you who create it (i.e. make this semen into a perfect human being), or are We the Creator?

source: نحن قدرنا بينكم الموت وما نحن بمسبوقين
en: We have decreed death to you all, and We are not outstripped,

source: على أن نبدل أمثالكم وننشئكم في ما لا تعلمون
en: To transfigure you and create you in (forms) that you know not.

source: ولقد علمتم النشأة الأولى فلولا تذكرون
en: And indeed, you have already known the first form of creation (i.e. the creation of Adam): why then do you not remember (or take heed)?

source: أفرأيتم ما تحرثون
en: Then tell Me about the seed that you sow in the ground.

source: أأنتم تزرعونه أم نحن الزارعون
en: Is it you that make it grow, or are We the Grower?

source: لو نشاء لجعلناه حطاما فظلتم تفكهون
en: Were it Our Will, We could crumble it to dry pieces, and you would be regretful (or left in wonderment) [Tafsir Ibn Kathir].

source: إنا لمغرمون
en: (Saying): "We are indeed Mughramun (i.e. ruined or have lost the money without any profit, or are punished by the loss of all that we spend for cultivation)! (Tafsir Al-Qurtubi)

source: بل نحن محرومون
en: "Nay, but we are deprived!"

source: أفرأيتم الماء الذي تشربون
en: Then tell Me about the water that you drink.

source: أأنتم أنزلتموه من المزن أم نحن المنزلون
en: Is it you who cause it from the rain-clouds to come down, or are We the Causer of it to come down?

source: لو نشاء جعلناه أجاجا فلولا تشكرون
en: If We willed, We verily could make it salt (and undrinkable): why then do you not give thanks (to Allah)?

source: أفرأيتم النار التي تورون
en: Then tell Me about the fire which you kindle.

source: أأنتم أنشأتم شجرتها أم نحن المنشئون
en: Is it you who made the tree thereof to grow, or are We the Grower?

source: نحن جعلناها تذكرة ومتاعا للمقوين
en: We have made it a Reminder (of the Hell-fire in the Hereafter), and an article of use for the travellers (and all the others, in this world).

source: فسبح باسم ربك العظيم
en: Then glorify with praises the Name of your Lord, the Most Great.

source: فلا أقسم بمواقع النجوم
en: So I swear by the setting of the stars.

source: وإنه لقسم لو تعلمون عظيم
en: And verily that is indeed a great oath, if you but know.

source: إنه لقرآن كريم
en: That (this) is indeed an honourable recitation (the Noble Qur'an).

source: في كتاب مكنون
en: In a Book well-guarded (with Allah in the heaven i.e. Al-Lauh Al-Mahfuz ).

source: لا يمسه إلا المطهرون
en: Which (that Book with Allah) none can touch but the purified (i.e. the angels).

source: تنزيل من رب العالمين
en: A Revelation (this Qur'an) from the Lord of the 'Alamin (mankind, jinn and all that exists).

source: أفبهذا الحديث أنتم مدهنون
en: Is it such a talk (this Qur'an) that you (disbelievers) deny?

source: وتجعلون رزقكم أنكم تكذبون
en: And instead (of thanking Allah) for the provision He gives you, you deny (Him by disbelief)!

source: فلولا إذا بلغت الحلقوم
en: Then why do you not (intervene) when (the soul of a dying person) reaches the throat?

source: وأنتم حينئذ تنظرون
en: And you at the moment are looking on,

source: ونحن أقرب إليه منكم ولكن لا تبصرون
en: But We (i.e. Our angels who take the soul) are nearer to him than you, but you see not, (Tafsir At-Tabari)

source: فلولا إن كنتم غير مدينين
en: Then why do you not - if you are exempt from the reckoning and recompense (punishment) -

source: ترجعونها إن كنتم صادقين
en: Bring back the soul (to its body), if you are truthful?

source: فأما إن كان من المقربين
en: Then, if he (the dying person) be of the Muqarrabun (those brought near to Allah),

source: فروح وريحان وجنت نعيم
en: (There is for him) rest and provision, and a Garden of Delights (Paradise).

source: وأما إن كان من أصحاب اليمين
en: And if he (the dying person) be of those on the Right Hand,

source: فسلام لك من أصحاب اليمين
en: Then there is safety and peace (from the Punishment of Allah) for those on the right Hand.

source: وأما إن كان من المكذبين الضالين
en: But if he (the dying person) be of the denying (of the Resurrection), the erring (away from the Right Path of Islamic Monotheism),

source: فنزل من حميم
en: Then for him is an entertainment with boiling water.

source: وتصلية جحيم
en: And burning in Hell-fire.

source: إن هذا لهو حق اليقين
en: Verily, this! This is an absolute Truth with certainty.

source: سبح لله ما في السماوات والأرض وهو العزيز الحكيم
en: Whatsoever is in the heavens and the earth glorifies Allah - and He is the All-Mighty, All-Wise.

source: له ملك السماوات والأرض يحيي ويميت وهو على كل شيء قدير
en: His is the kingdom of the heavens and the earth. It is He Who gives life and causes death: and He is Able to do all things.

source: هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم
en: He is the First (nothing is before Him) and the Last (nothing is after Him), the Most High (nothing is above Him) and the Most Near (nothing is nearer than Him). And He is the All-Knower of every thing.

source: هو الذي خلق السماوات والأرض في ستة أيام ثم استوى على العرش يعلم ما يلج في الأرض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو معكم أين ما كنتم والله بما تعملون بصير
en: He it is Who created the heavens and the earth in six Days and then rose over (Istawa) the Throne (in a manner that suits His Majesty). He knows what goes into the earth and what comes forth from it, and what descends from the heaven and what ascends thereto. And He is with you (by His Knowledge) wheresoever you may be. And Allah is the All-Seer of what you do.

source: له ملك السماوات والأرض وإلى الله ترجع الأمور
en: His is the kingdom of the heavens and the earth. And to Allah return all the matters (for decision).

source: يولج الليل في النهار ويولج النهار في الليل وهو عليم بذات الصدور
en: He merges night into day (i.e. the decrease in the hours of the night is added into the hours of the day), and merges day into night (i.e. the decrease in the hours of the day is added into the hours of the night), and He has full knowledge of whatsoever is in the breasts.

source: آمنوا بالله ورسوله وأنفقوا مما جعلكم مستخلفين فيه فالذين آمنوا منكم وأنفقوا لهم أجر كبير
en: Believe in Allah and His Messenger (Muhammad صلى الله عليه وسلم), and spend of that whereof He has made you trustees. And such of you as believe and spend (in Allah's Way), theirs will be a great reward.

source: وما لكم لا تؤمنون بالله والرسول يدعوكم لتؤمنوا بربكم وقد أخذ ميثاقكم إن كنتم مؤمنين
en: And what is the matter with you that you believe not in Allah! While the Messenger (Muhammad صلى الله عليه وسلم) invites you to believe in your Lord (Allah); and He (Allah) has indeed taken your covenant, if you are real believers.

source: هو الذي ينزل على عبده آيات بينات ليخرجكم من الظلمات إلى النور وإن الله بكم لرءوف رحيم
en: It is He Who sends down manifest Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) to His slave (Muhammad صلى الله عليه وسلم) that He may bring you out from darkness into light. And verily, Allah is to you full of kindness, Most Merciful.

source: وما لكم ألا تنفقوا في سبيل الله ولله ميراث السماوات والأرض لا يستوي منكم من أنفق من قبل الفتح وقاتل أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا وكلا وعد الله الحسنى والله بما تعملون خبير
en: And what is the matter with you that you spend not in the Cause of Allah? And to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent and fought before the conquering (of Makkah, with those among you who did so later). Such are higher in degree than those who spent and fought afterwards. But to all Allah has promised the best (reward). And Allah is All-Aware of what you do.

source: من ذا الذي يقرض الله قرضا حسنا فيضاعفه له وله أجر كريم
en: Who is he that will lend Allah a goodly loan: then (Allah) will increase it manifold to his credit (in repaying), and he will have (besides) a good reward (i.e. Paradise).

source: يوم ترى المؤمنين والمؤمنات يسعى نورهم بين أيديهم وبأيمانهم بشراكم اليوم جنات تجري من تحتها الأنهار خالدين فيها ذلك هو الفوز العظيم
en: On the Day you shall see the believing men and the believing women: their light running forward before them and by their right hands. Glad tidings for you this Day! Gardens under which rivers flow (Paradise), to dwell therein forever! Truly, this is the great success!

source: يوم يقول المنافقون والمنافقات للذين آمنوا انظرونا نقتبس من نوركم قيل ارجعوا وراءكم فالتمسوا نورا فضرب بينهم بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب
en: On the Day when the hypocrites - men and women - will say to the believers: "Wait for us! Let us get something from your light!" It will be said: "Go back to your rear! Then seek a light!" So a wall will be put up between them, with a gate therein. Inside it will be mercy, and outside it will be torment."

source: ينادونهم ألم نكن معكم قالوا بلى ولكنكم فتنتم أنفسكم وتربصتم وارتبتم وغرتكم الأماني حتى جاء أمر الله وغركم بالله الغرور
en: (The hypocrites) will call the believers: "Were we not with you?" The believers will reply: "Yes! But you led yourselves into temptations, you looked forward for our destruction; you doubted (in Faith) and you were deceived by false desires, till the Command of Allah came to pass. And the chief deceiver (Satan) deceived you in respect of Allah."

source: فاليوم لا يؤخذ منكم فدية ولا من الذين كفروا مأواكم النار هي مولاكم وبئس المصير
en: So this Day no ransom shall be taken from you (hypocrites), nor of those who disbelieved, (in the Oneness of Allah - Islamic Monotheism). Your abode is the Fire. That is your maula (friend - proper place), and worst indeed is that destination.

source: ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله وما نزل من الحق ولا يكونوا كالذين أوتوا الكتاب من قبل فطال عليهم الأمد فقست قلوبهم وكثير منهم فاسقون
en: Has not the time come for the hearts of those who believe (in the Oneness of Allah - Islamic Monotheism) to be affected by Allah's Reminder (this Qur'an), and that which has been revealed of the truth, lest they become as those who received the Scripture [the Taurat (Torah) and the Injeel (Gospel)] before (i.e. Jews and Christians), and the term was prolonged for them and so their hearts were hardened? And many of them were Fasiqun (the rebellious, the disobedient to Allah).

source: اعلموا أن الله يحيي الأرض بعد موتها قد بينا لكم الآيات لعلكم تعقلون
en: Know that Allah gives life to the earth after its death! Indeed We have made clear the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) to you, if you but understand.

source: إن المصدقين والمصدقات وأقرضوا الله قرضا حسنا يضاعف لهم ولهم أجر كريم
en: Verily, those who give Sadaqat (i.e. Zakat and alms), men and women, and lend Allah a goodly loan, it shall be increased manifold (to their credit), and theirs shall be an honourable good reward (i.e. Paradise).

source: والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء عند ربهم لهم أجرهم ونورهم والذين كفروا وكذبوا بآياتنا أولئك أصحاب الجحيم
en: And those who believe in (the Oneness of) Allah and His Messengers - they are the Siddiqun (i.e. those followers of the Prophets who were first and foremost to believe in them), and the martyrs with their Lord, they shall have their reward and their light. But those who disbelieve (in the Oneness of Allah - Islamic Monotheism) and deny Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) - they shall be the dwellers of the blazing Fire.

source: اعلموا أنما الحياة الدنيا لعب ولهو وزينة وتفاخر بينكم وتكاثر في الأموال والأولاد كمثل غيث أعجب الكفار نباته ثم يهيج فتراه مصفرا ثم يكون حطاما وفي الآخرة عذاب شديد ومغفرة من الله ورضوان وما الحياة الدنيا إلا متاع الغرور
en: Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children. (It is) as the likeness of vegetation after rain, thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment (for the disbelievers - evil-doers), and (there is) Forgiveness from Allah and (His) Good Pleasure (for the believers - good-doers). And the life of this world is only a deceiving enjoyment.

source: سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض أعدت للذين آمنوا بالله ورسله ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم
en: Race with one another in hastening towards forgiveness from your Lord (Allah), and Paradise the width whereof is as the width of the heaven and the earth, prepared for those who believe in Allah and His Messengers. That is the Grace of Allah which He bestows on whom He is pleased with. And Allah is the Owner of Great Bounty.

source: ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها إن ذلك على الله يسير
en: No calamity befalls on the earth or in yourselves but it is inscribed in the Book of Decrees (Al-Lauh Al-Mahfuz) before We bring it into existence. Verily, that is easy for Allah.

source: لكيلا تأسوا على ما فاتكم ولا تفرحوا بما آتاكم والله لا يحب كل مختال فخور
en: In order that you may not grieve at the things that you fail to get, nor rejoice over that which has been given to you. And Allah likes not prideful boasters.

source: الذين يبخلون ويأمرون الناس بالبخل ومن يتول فإن الله هو الغني الحميد
en: Those who are misers and enjoin upon people miserliness - (Allah is not in need of their charity). And whosoever turns away (from Faith - Allah's Monotheism), then Allah is Rich (Free of all needs), Worthy of all praise.

source: لقد أرسلنا رسلنا بالبينات وأنزلنا معهم الكتاب والميزان ليقوم الناس بالقسط وأنزلنا الحديد فيه بأس شديد ومنافع للناس وليعلم الله من ينصره ورسله بالغيب إن الله قوي عزيز
en: Indeed We have sent Our Messengers with clear proofs, and revealed with them the Scripture and the Balance (justice) that mankind may keep up justice. And We brought forth iron wherein is mighty power (in matters of war ), as well as many benefits for mankind, that Allah may test who it is that will help Him (His religion) and His Messengers in the unseen. Verily, Allah is All-Strong, All-Mighty.

source: ولقد أرسلنا نوحا وإبراهيم وجعلنا في ذريتهما النبوة والكتاب فمنهم مهتد وكثير منهم فاسقون
en: And indeed, We sent Nuh (Noah) and Ibrahim (Abraham), and placed in their offspring Prophethood and Scripture. And among them there are some who are guided; but many of them are Fasiqun (rebellious, disobedient to Allah).

source: ثم قفينا على آثارهم برسلنا وقفينا بعيسى ابن مريم وآتيناه الإنجيل وجعلنا في قلوب الذين اتبعوه رأفة ورحمة ورهبانية ابتدعوها ما كتبناها عليهم إلا ابتغاء رضوان الله فما رعوها حق رعايتها فآتينا الذين آمنوا منهم أجرهم وكثير منهم فاسقون
en: Then, We sent after them Our Messengers, and We sent 'Îsa (Jesus) - son of Maryam (Mary), and gave him the Injeel (Gospel). And We ordained in the hearts of those who followed him compassion and mercy. But the monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but they did not observe it with the right observance. So We gave those among them who believed their (due) reward; but many of them are Fasiqun (rebellious, disobedient to Allah).

source: يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله يؤتكم كفلين من رحمته ويجعل لكم نورا تمشون به ويغفر لكم والله غفور رحيم
en: O you who believe [in Musa (Moses) (i.e. Jews) and 'Îsa (Jesus) (i.e. Christians)]! Fear Allah, and believe in His Messenger (Muhammad صلى الله عليه وسلم), He will give you a double portion of His Mercy, and He will give you a light by which you shall walk (straight). And He will forgive you. And Allah is Oft-Forgiving, Most Merciful.

source: لئلا يعلم أهل الكتاب ألا يقدرون على شيء من فضل الله وأن الفضل بيد الله يؤتيه من يشاء والله ذو الفضل العظيم
en: So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allah, and that (His) Grace is (entirely) in His Hand to bestow it on whomsoever He wills. And Allah is the Owner of Great Bounty.

source: قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله والله يسمع تحاوركما إن الله سميع بصير
en: Indeed Allah has heard the statement of her (Khaulah bint Tha'labah) that disputes with you (O Muhammad صلى الله عليه وسلم) concerning her husband (Aus bin As-Samit), and complains to Allah. And Allah hears the argument between you both. Verily, Allah is All-Hearer, All-Seer.

source: الذين يظاهرون منكم من نسائهم ما هن أمهاتهم إن أمهاتهم إلا اللائي ولدنهم وإنهم ليقولون منكرا من القول وزورا وإن الله لعفو غفور
en: Those among you who make their wives unlawful to them by (Zihar الظهار) (i.e. by saying to them "You are like my mother's back,") they cannot be their mothers. None can be their mothers except those who gave them birth. And verily, they utter an ill word and a lie. And verily, Allah is Oft-Pardoning, Oft-Forgiving.

source: والذين يظاهرون من نسائهم ثم يعودون لما قالوا فتحرير رقبة من قبل أن يتماسا ذلكم توعظون به والله بما تعملون خبير
en: And those who make unlawful to them their wives by Zihar and wish to free themselves from what they uttered, (the penalty) in that case is the freeing of a slave before they touch each other. That is an admonition to you (so that you may not repeat such an ill thing). And Allah is All-Aware of what you do.

source: فمن لم يجد فصيام شهرين متتابعين من قبل أن يتماسا فمن لم يستطع فإطعام ستين مسكينا ذلك لتؤمنوا بالله ورسوله وتلك حدود الله وللكافرين عذاب أليم
en: And he who finds not (the money for freeing a slave) must fast two successive months before they both touch each other. And he who is unable to do so, should feed sixty Miskins (poor). That is in order that you may have perfect Faith in Allah and His Messenger. These are the limits set by Allah. And for disbelievers, there is a painful torment.

source: إن الذين يحادون الله ورسوله كبتوا كما كبت الذين من قبلهم وقد أنزلنا آيات بينات وللكافرين عذاب مهين
en: Verily, those who oppose Allah and His Messenger (Muhammad صلى الله عليه وسلم) will be disgraced, as those before them (among the past nation) were disgraced. And We have sent down clear Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.). And for the disbelievers is a disgracing torment.

source: يوم يبعثهم الله جميعا فينبئهم بما عملوا أحصاه الله ونسوه والله على كل شيء شهيد
en: On the Day when Allah will resurrect them all together (i.e. on the Day of Resurrection) and inform them of what they did. Allah has kept account of it, while they have forgotten it. And Allah is Witness over all things.

source: ألم تر أن الله يعلم ما في السماوات وما في الأرض ما يكون من نجوى ثلاثة إلا هو رابعهم ولا خمسة إلا هو سادسهم ولا أدنى من ذلك ولا أكثر إلا هو معهم أين ما كانوا ثم ينبئهم بما عملوا يوم القيامة إن الله بكل شيء عليم
en: Have you not seen that Allah knows whatsoever is in the heavens and whatsoever is on the earth? There is no Najwa (secret counsel) of three but He is their fourth (with His Knowledge, while He Himself is over the Throne, over the seventh heaven), nor of five but He is their sixth (with His Knowledge), nor of less than that or more but He is with them (with His Knowledge) wheresoever they may be. And afterwards on the Day of Resurrection He will inform them of what they did. Verily, Allah is the All-Knower of everything.

source: ألم تر إلى الذين نهوا عن النجوى ثم يعودون لما نهوا عنه ويتناجون بالإثم والعدوان ومعصيت الرسول وإذا جاءوك حيوك بما لم يحيك به الله ويقولون في أنفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير
en: Have you not seen those who were forbidden to hold secret counsels, and afterwards returned to that which they had been forbidden, and conspired together for sin and wrong doing and disobedience to the Messenger (Muhammad صلى الله عليه وسلم). And when they come to you, they greet you with a greeting wherewith Allah greets you not, and say within themselves: "Why should Allah punish us not for what we say?" Hell will be sufficient for them; they will burn therein. And worst indeed is that destination!

source: يا أيها الذين آمنوا إذا تناجيتم فلا تتناجوا بالإثم والعدوان ومعصيت الرسول وتناجوا بالبر والتقوى واتقوا الله الذي إليه تحشرون
en: O you who believe! When you hold secret counsel, do it not for sin and wrong-doing, and disobedience towards the Messenger (Muhammad صلى الله عليه وسلم), but do it for Al-Birr (righteousness) and Taqwa (virtues and piety); and fear Allah unto Whom you shall be gathered.

source: إنما النجوى من الشيطان ليحزن الذين آمنوا وليس بضارهم شيئا إلا بإذن الله وعلى الله فليتوكل المؤمنون
en: Secret counsels (conspiracies) are only from Shaitan (Satan), in order that he may cause grief to the believers. But he cannot harm them in the least, except as Allah permits. And in Allah let the believers put their trust .

source: يا أيها الذين آمنوا إذا قيل لكم تفسحوا في المجالس فافسحوا يفسح الله لكم وإذا قيل انشزوا فانشزوا يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات والله بما تعملون خبير
en: O you who believe! When you are told to make room in the assemblies, (spread out and) make room. Allah will give you (ample) room (from His Mercy). And when you are told to rise up [for prayers, or Jihad (holy fighting in Allah's cause), or for any other good deed], rise up. Allah will exalt in degree those of you who believe, and those who have been granted knowledge. And Allah is Well-Acquainted with what you do.
